"""
公用数据，避免代码段重复
"""

# 定义关节连接关系（示例，根据实际数据结构调整）
POSE_CONNECTIONS = [
    (11, 12),  # 左肩 -> 右肩
    (11, 13),  # 左肩 -> 左肘
    (12, 14),  # 右肩 -> 右肘
    (13, 15),  # 左肘 -> 左手
    (14, 16),  # 右肘 -> 右手
    (11, 23),  # 左肩 -> 左髋
    (12, 24),  # 右肩 -> 右髋
    (23, 25),  # 左髋 -> 左膝
    (24, 26),  # 右髋 -> 右膝
    (23, 24),  # 左髋 -> 右髋
    (25, 27),  # 左膝 -> 左脚
    (26, 28),  # 右膝 -> 右脚
]

# 颜色 BGR
COLOR = {
    "red": (0, 0, 255),
    "green": (0, 255, 0),
    "blue": (150, 50, 50),
    "babyblue": (240, 207, 137),
    "lightyellow": (137, 207, 240),
    "pink": (255, 0, 255),
    "yellow": (0, 255, 255)
}

if __name__ == "__main__":
    pass